var r = 1;
var l = 1;

var syllable = ["бь","ба","бя","бэ","бе","бо","бё","бы","би","бу","бю",
				"вь","ва","вя","вэ","ве","во","вё","вы","ви","ву","вю",
				"га","гя","гэ","ге","го","гё","гы","ги","гу","гю",
				"жа","же","жо","жи","жу",
				"дь","да","дя","дэ","де","до","дё","ды","ди","ду","дю",
				"зь","за","зя","зэ","зе","зо","зё","зы","зи","зу","зю",
				"ка","кякэ","ке","ко","кё","кы","ки","ку","кю",
				"чь","ча","че","чё","чи","чу",
				"ль","ла","ля","лэ","ле","ло","лё","лы","ли","лу","лю",
				"мь","ма","мя","мэ","ме","мо","мё","мы","ми","му","мю",
				"н","нь","на","ня","нэ","не","но","нё","ны","ни","ну","ню",
				"пь","па","пя","пэ","пе","по","пё","пы","пи","пу","пю",
				"рь","ра","ря","рэ","ре","ро","рё","ры","ри","ру","рю",
				"сь","са","ся","сэ","се","со","сё","сы","си","су","сю",
				"ть","та","тя","тэ","те","то","тё","ты","ти","ту","тю",
				"фь","фа","фя","фэ","фе","фо","фё","фы","фи","фу","фю",
				"ха","хэ","хе","хо","хи","ху",
				"ша","ше","шо","ши","шу",
				"ца","це","цо","цы","цу",
				"щь","ща","ще","щё","щи","щу"];
				
var realWords = ["математика", "команда", "подарок", "пират", "друг", "щенок", "школа", "аист", "радуга", "меню", 
					"заяц", "учительница", "бумага", "фломастер", "щука", "луна", "писатель", "сокровище", "торт", 
					"парк", "спорт", "велосипед", "автобус", "путешествие", "счёт", "ромашка", "рыбак", "стол", "стадион", 
					"успех","мультифора", "гяповать", "кичкинка", "кефирка", "чуни", "катавасия", "галимый", "скубут", "скабрезный", 
					"расфуфыренная", "мандиблы", "бибабо", "рампетка", "пержня", "михрютка", "бильбоке", "инсинуация", "апофеоз", 
					"экзерсис", "буза", "гаманок", "трихомудии", "аксельбанты", "амикошонство", "анагога", "лукуллов", 
					"каннелюра", "эсхатология", "бургомистрство", "фельдъегерь", "лауэит", "хухря", "анчутка", "пердимонокль", 
					"гапаксы", "джерегеля"];
var isTrueWord = true;

 window.onload = function() {					//+ проверка на видимость данного раздела
    setTimeout(setWord, 2000);
  };

function setWord() {
	var rand = Math.random()*10;
	var word; 
	if (rand > 5) {
		word = setRandomWord();
		isTrueWord = false;
	} else {
		word = realWords[Math.floor(Math.random() * realWords.length)];
		isTrueWord = true;
	}
	
	document.getElementById("testWord").innerHTML = word;
}

function setRandomWord() {
	var length = Math.ceil((Math.random()*10)) +2;   //кол-во слогов  [1,12]
	if (length > 11) length = length - 7;		     //[1,5]
	if (length > 6) length = length - 5;		     //число от 3 до 5
	
	var word = "";
	for(var i = 1; i < length; i++) {
		word += syllable[Math.floor(Math.random() * syllable.length)] //consonants[Math.floor(Math.random() * consonants.length)] + vowels[Math.floor(Math.random() * vowels.length)]
	}

	return word;
}

function setAnswer(ans) {
	if (isTrueWord) {
		if (ans) left(); else right();
	} else {
		if (!ans) left(); else right();
	}
	setTimeout(setWord, 500);
}

function right() {
	var el = document.getElementById("right").innerHTML = r;
	r++;
	document.getElementsByClassName("right")[0].style.flexGrow = r;
}

function left() {
	document.getElementById("left").innerHTML = l;
	l++;
	document.getElementsByClassName("left")[0].style.flexGrow = l;
}